#использовать "../src/core"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПрочитатьНастройкиИзФайла");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПрочитатьНастройкиИзФайла() Экспорт

	ФайлШаблонНастроек = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", ".orca.yaml"); 

	НастройкаВыпуска = Новый НастройкаВыпуска();
	НастройкаВыпуска.ЗагрузитьИзФайла(ФайлШаблонНастроек);
	СтруктураНастроек = НастройкаВыпуска.ВСтруктуру();

	Утверждения.ПроверитьРавенство(СтруктураНастроек.ИмяПроекта, "orca", "имя проекта должно быть прочтено");
	Утверждения.ПроверитьРавенство(СтруктураНастроек.НастройкаСборки.ИмяПриложения, "orca", "имя проекта должно быть прочтено");
	
КонецПроцедуры

Лог = Логирование.ПолучитьЛог("oscript.lib.orca.config");
Лог.УстановитьУровень(УровниЛога.Отладка);